{
    "catpics": [
      {
        "uri": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR-RyKa-DFc31yM6YnVxmbpH-Wh-TGhvGs-EbC9mIBiOSk2i3fIyw",
        "caption": "What Is Finance?",
        "text": "Finance is a broad term that describes activities associated with banking, leverage or debt, credit, capital markets, money, and investments. Basically, finance represents money management and the process of acquiring needed funds. Finance also encompasses the oversight, creation, and study of money, banking, credit, investments, assets, and liabilities that make up financial systems.\n Many of the basic concepts in finance originate from microeconomic and macroeconomic theories. One of the most fundamental theories is the time value of money, which essentially states that a dollar today is worth more than a dollar in the future."
      },
      {
        "uri": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS98L84tAK-a3H-k2vrqwA3WqawIYFa0HJ3bB55M6iwxXkuthtffA",
        "caption": "What Is Personal Finance?",
        "text": "Personal finance is a term that covers managing your money as well as saving and investing. It encompasses budgeting, banking, insurance, mortgages, investments, retirement planning, and tax and estate planning. The term often refers to the entire industry that provides financial services to individuals and households and advises them about financial and investment opportunities.\n Personal finance is about meeting personal financial goals, whether it’s having enough for short-term financial needs, planning for retirement, or saving for your child’s college education. It all depends on your income, expenses, living requirements, and individual goals and desires—and coming up with a plan to fulfill those needs within your financial constraints. To make the most of your income and savings, it’s important to become financially literate, so you can distinguish between good and bad advice and make smart decisions."
      },
      {
        "uri": "http://r.ddmcdn.com/s_f/o_1/cx_462/cy_245/cw_1349/ch_1349/w_720/APL/uploads/2015/06/caturday-shutterstock_149320799.jpg",
        "caption": "Devise a budget",
        "text": "A budget is essential to living within your means and saving enough to meet your long-term goals. The 50/30/20 budgeting method offers a great framework. It breaks down like this:\n\n Fifty percent of your take-home pay or net income (after taxes, that is) goes toward living essentials, such as rent, utilities, groceries, and transport.\n\n Thirty percent is allocated to discretionary expenses, such as dining out and shopping for clothes. Giving to charity can go here as well.\n\n Twenty percent goes toward the future-paying down debt and saving for retirement and emergencies."
      },
      {
        "uri": "http://r.ddmcdn.com/s_f/o_1/cx_462/cy_245/cw_1349/ch_1349/w_720/APL/uploads/2015/06/caturday-shutterstock_149320799.jpg",
        "caption": "Limit debt",
        "text": "It sounds simple enough: To keep debt from getting out of hand, don't spend more than you earn. Of course, most people do have to borrow from time to time, and sometimes going into debt can be advantageous—for example, if it leads to acquiring an asset. Taking out a mortgage to buy a house might be one such case. Still, leasing can sometimes be more economical than buying outright, whether you’re renting a property, leasing a car, or even getting a subscription to computer software."
      },
      {
        "uri": "http://r.ddmcdn.com/s_f/o_1/cx_462/cy_245/cw_1349/ch_1349/w_720/APL/uploads/2015/06/caturday-shutterstock_149320799.jpg",
        "caption": "Use credit cards wisely",
        "text": "Credit cards can be major debt traps, but it's unrealistic not to own any in the contemporary world. Furthermore, they have applications beyond buying things. They are not only crucial to establishing your credit rating but also a great way to track spending, which can be a big budgeting aid.\n\nCredit just needs to be managed correctly, which means that you should pay off your full balance every month, or at least keep your credit utilization ratio at a minimum (that is, keep your account balances below 30% of your total available credit). Given the extraordinary rewards incentives offered these days (such as cash back), it makes sense to charge as many purchases as possible if you can pay your bills in full. Most important: Avoid maxing out credit cards at all costs, and always pay bills on time. One of the fastest ways to ruin your credit score is to constantly pay bills late—or even worse, miss payments (see tip five).\n\nUsing a debit card, which takes money directly from your bank account, is another way to ensure that you will not be paying for accumulated small purchases over an extended period with interest."
      }
    ]
  }